#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_pet.secret_name: Refreshing state... [id=strangely-steady-monkfish]
random_password.master: Refreshing state... [id=none]
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.email_request_processor.data.aws_ecr_image.lambda_image: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_region.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_region.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_region.current: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.list_collections.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.email_request_processor.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=3277652423]
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.memory.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-memory-dev]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.list_collections.data.aws_ecr_image.lambda_image: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.ingestion.aws_s3_bucket.ingestion_source_storage: Refreshing state... [id=levio-demo-fev-storage-dev]
module.list_collections.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
aws_api_gateway_api_key.this: Refreshing state... [id=mwfvag0h0f]
module.ingestion.aws_sqs_queue.dead_letter_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev_dead_letter]
module.lex_router.module.lambda_function_container_image.data.aws_region.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_ami.latest_amazon_linux: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-00fb300ee2d2f7b3b]
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.list_collections.module.api_gateway.data.aws_caller_identity.current: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
aws_db_parameter_group.default: Refreshing state... [id=rds-pg]
module.list_collections.module.api_gateway.data.aws_caller_identity.current: Read complete after 1s [id=446872271111]
module.email_response_processor.data.aws_caller_identity.current: Reading...
module.email_response_processor.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
aws_iam_role.this: Refreshing state... [id=levio-demo-fev-api-role]
module.memory.aws_dynamodb_table.basic-conversation_memory_table-table: Refreshing state... [id=levio-demo-fev-chat-history-dev]
module.email_response_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_region.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1348983281]
module.email_response_processor.data.aws_ecr_image.lambda_image: Reading...
module.email_request_processor.data.aws_ecr_image.lambda_image: Read complete after 1s [id=sha256:a44232f8ae329b9de96680843e4eaa5f97f23f5c5bd696d99a0e060a9af16d34]
module.memory.data.aws_ecr_image.lambda_image: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.email_request_processor.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.inference.module.api_gateway.data.aws_caller_identity.current: Reading...
data.aws_ami.latest_amazon_linux: Read complete after 1s [id=ami-03c951bbe993ea087]
module.email_request_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.inference.module.api_gateway.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.inference.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.memory.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.email_response_processor.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.inference.module.lambda_function_container_image.data.aws_region.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.list_collections.data.aws_ecr_image.lambda_image: Read complete after 1s [id=sha256:d7d3053d214375c2f1669cd5b66deb6deaf44e026a39db42a48d659eaf5bb71f]
module.lex_router.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
aws_secretsmanager_secret.password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD]
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.list_collections.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role]
module.email_response_processor.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:580f418354aee11c642823f61dc2189011db73524bc382049ac16796c9ded18d]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.ingestion.data.aws_ecr_image.lambda_image: Reading...
module.memory.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:3ca6a491ac127dada2b9ca8a470855f761ba0374c1bbc1abfeae1b1468363c7d]
data.aws_availability_zones.available: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
aws_api_gateway_rest_api.this: Refreshing state... [id=d09uj3e9kh]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.list_collections.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-list-collections-dev]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.inference.data.aws_ecr_image.lambda_image: Reading...
module.lex_router.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-lex-router-dev]
module.ingestion.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-ingestion-dev]
module.memory.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.lex_router.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.memory.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-memory-dev-role-inline]
module.inference.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-inference-dev]
module.ingestion.data.aws_ecr_image.lambda_image: Read complete after 1s [id=sha256:cd9e0205c77acf8e6f5df853a5d71cb1acac8b880f946caefba7a2ee78bd3a82]
module.lex_router.data.aws_ecr_image.lambda_image: Reading...
module.inference.data.aws_ecr_image.lambda_image: Read complete after 1s [id=sha256:d676940b1f9fe4fcfbb9c254da9911e302786782bde89fd3f8892e6c3ee322d2]
module.ingestion.aws_sqs_queue.queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev]
module.lex_router.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-lex-router-dev-role-inline]
module.memory.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role]
module.ingestion.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role]
data.aws_secretsmanager_secret.password: Reading...
aws_secretsmanager_secret_version.password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD|terraform-20240126151709956800000002]
aws_api_gateway_account.this: Refreshing state... [id=api-gateway-account]
aws_iam_role_policy.this: Refreshing state... [id=levio-demo-fev-api-role:this]
aws_api_gateway_authorizer.this: Refreshing state... [id=mi1y1q]
module.inference.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role]
module.lex_router.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:8573c95bbbb88f8f88139ffb3a323e9d15d8697b9810cf6fbc2d61376bb8d80c]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d7ddd92ffe7cad50]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-086b3e733d88fa370]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b9066ddfe118437e]
module.ingestion.data.aws_iam_policy_document.sqs_policy: Reading...
module.ingestion.data.aws_iam_policy_document.sqs_policy: Read complete after 0s [id=1366123725]
module.lex_router.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role-20240202183512646400000001]
aws_security_group.sm_sg: Refreshing state... [id=sg-013ee0bdd16b8366f]
aws_security_group.bedrock_sg: Refreshing state... [id=sg-0902cb6d437a968b6]
data.aws_secretsmanager_secret.password: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD]
aws_security_group.lambda_egress_all_sg: Refreshing state... [id=sg-054f9a76901acf353]
aws_security_group.jumpbox_sg: Refreshing state... [id=sg-0b9900b5db426c576]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3522429600]
module.ingestion.aws_sqs_queue_policy.sqs_policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=736838273]
module.inference.module.api_gateway.aws_api_gateway_resource.api_gateway_resource: Refreshing state... [id=c30cce]
module.list_collections.module.api_gateway.aws_api_gateway_resource.api_gateway_resource: Refreshing state... [id=i033qb]
data.aws_secretsmanager_secret_version.password: Reading...
module.memory.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role-20240126151710029800000004]
module.memory.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-memory-dev-role-logs]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3953744684]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=52771042]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2926739739]
module.list_collections.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-list-collections-dev-role-logs]
data.aws_secretsmanager_secret_version.password: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD|AWSCURRENT]
module.inference.module.api_gateway.aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-d09uj3e9kh-c30cce-GET]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04aae6346ab85dfe5]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02f9981846a152b24]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09be498e3f465bbb5]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0bbe5e0845bba1093]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0d1f5f95132e695a6]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-03f5acb4bc8b5d586]
module.list_collections.module.api_gateway.aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-d09uj3e9kh-i033qb-GET]
module.lex_router.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-lex-router-dev-role-logs]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-dev-role-logs]
module.inference.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-inference-dev-role-logs]
module.inference.module.api_gateway.module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-d09uj3e9kh-c30cce-OPTIONS]
module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-0f03a46a772c6a571]
module.vpc.aws_route_table.database[1]: Refreshing state... [id=rtb-00ef44a2d775aaa99]
module.inference.module.api_gateway.aws_lambda_permission.lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway-levio-demo-fev-inference-dev]
aws_security_group.dynamo_db_sg: Refreshing state... [id=sg-0c6d3637458aa4799]
module.list_collections.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role-20240130201651725000000001]
module.list_collections.module.api_gateway.module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-d09uj3e9kh-i033qb-OPTIONS]
module.memory.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role-20240126151710095500000006]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02f9981846a152b241080289494]
aws_security_group.database_sg: Refreshing state... [id=sg-02511ace313a817bd]
module.list_collections.module.api_gateway.aws_lambda_permission.lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway-levio-demo-fev-list-collections-dev]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-066d9aa6005ec7c94]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0db0a8005c04ca4f2]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=ex-terraform-dev]
module.inference.module.api_gateway.module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-d09uj3e9kh-c30cce-OPTIONS]
module.inference.module.api_gateway.module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-d09uj3e9kh-c30cce-OPTIONS-200]
module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role-20240126151710029200000003]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role-20240126151710031000000005]
module.lex_router.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role-20240202183512785600000002]
aws_vpc_endpoint.secrets_manager_endpoint: Refreshing state... [id=vpce-07b8182fd57a40bc7]
aws_vpc_endpoint.lambda_endpoint: Refreshing state... [id=vpce-0b1660c4cfd3c329e]
aws_instance.jumpbox: Refreshing state... [id=i-0cd5eadbd064719b1]
aws_vpc_endpoint.bedrock_endpoint: Refreshing state... [id=vpce-0a8ed6effde8d7daf]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-044bfd1713e1c30ec]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0d7135c7f623e06f8]
module.list_collections.module.api_gateway.module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-d09uj3e9kh-i033qb-OPTIONS-200]
module.list_collections.module.api_gateway.module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-d09uj3e9kh-i033qb-OPTIONS]
aws_vpc_endpoint.dynamo_db_endpoint: Refreshing state... [id=vpce-04b83095daf470dae]
aws_vpc_endpoint.s3_endpoint: Refreshing state... [id=vpce-0fdf03f021658d47f]
module.inference.module.api_gateway.module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-d09uj3e9kh-c30cce-OPTIONS-200]
module.memory.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-memory-dev]
module.lex_router.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev]
module.list_collections.module.api_gateway.module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-d09uj3e9kh-i033qb-OPTIONS-200]
aws_db_instance.vector_db: Refreshing state... [id=db-KTG3TDKXH3C3BOXFTTIFJ5SASY]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1333636943]
module.list_collections.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-list-collections-dev-role-inline]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=242001761]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2560015702]
module.inference.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-inference-dev-role-inline]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-dev-role-inline]
module.list_collections.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role-20240202005532784400000004]
module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role-2024012615222187350000000e]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role-2024012615222186470000000d]
module.inference.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-inference-dev]
module.list_collections.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev]
module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev]
module.inference.module.api_gateway.aws_api_gateway_integration.api_gateway_integration: Refreshing state... [id=agi-d09uj3e9kh-c30cce-GET]
module.list_collections.module.api_gateway.aws_api_gateway_integration.api_gateway_integration: Refreshing state... [id=agi-d09uj3e9kh-i033qb-GET]
module.ingestion.aws_lambda_event_source_mapping.event_source_mapping: Refreshing state... [id=ffdd3b10-6ac6-4fbf-bbd1-a7e6e82bf9d1]
aws_api_gateway_deployment.this: Refreshing state... [id=0w246c]
module.ingestion.aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=levio-demo-fev-storage-dev]
aws_api_gateway_stage.this: Refreshing state... [id=ags-d09uj3e9kh-dev]
aws_api_gateway_usage_plan.this: Refreshing state... [id=jxe0z0]
aws_api_gateway_usage_plan_key.this: Refreshing state... [id=mwfvag0h0f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_api_gateway_deployment.this must be replaced
+/- resource "aws_api_gateway_deployment" "this" {
      ~ created_date  = "2024-02-21T19:29:46Z" -> (known after apply)
      ~ description   = "Deployment for 2024-02-21T19:29:46Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:446872271111:d09uj3e9kh/" -> (known after apply)
      ~ id            = "0w246c" -> (known after apply)
      ~ invoke_url    = "https://d09uj3e9kh.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          - "redeployment" = "2024-02-21T19:29:46Z"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.this will be updated in-place
  ~ resource "aws_api_gateway_stage" "this" {
      ~ deployment_id         = "0w246c" -> (known after apply)
        id                    = "ags-d09uj3e9kh-dev"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.email_request_processor.module.fifo_sqs.aws_sqs_queue.this[0] will be created
  + resource "aws_sqs_queue" "this" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = true
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "levio-demo-fev-email-request-processor-queue-dev.fifo"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags_all                          = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 60
    }

  # module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:*",
            ]
          + sid       = "loggroup"
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:log-group:/aws/levio-demo-fev-email-request-processor-dev/*:*",
            ]
          + sid       = "logwrite"
        }
      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
          + sid       = "requestsqs"
        }
      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
          + sid       = "responsesqs"
        }
    }

  # module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.email_request_processor.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/levio-demo-fev-email-request-processor-dev"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # module.email_request_processor.module.lambda_function_container_image.aws_iam_policy.additional_inline[0] will be created
  + resource "aws_iam_policy" "additional_inline" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "levio-demo-fev-email-request-processor-dev-role-inline"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # module.email_request_processor.module.lambda_function_container_image.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "levio-demo-fev-email-request-processor-dev-role-logs"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # module.email_request_processor.module.lambda_function_container_image.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "levio-demo-fev-email-request-processor-dev-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.email_request_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_inline" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "levio-demo-fev-email-request-processor-dev-role"
    }

  # module.email_request_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "levio-demo-fev-email-request-processor-dev-role"
    }

  # module.email_request_processor.module.lambda_function_container_image.aws_lambda_event_source_mapping.this["sqs"] will be created
  + resource "aws_lambda_event_source_mapping" "this" {
      + enabled                       = true
      + event_source_arn              = (known after apply)
      + function_arn                  = (known after apply)
      + function_name                 = (known after apply)
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # module.email_request_processor.module.lambda_function_container_image.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "levio-demo-fev-email-request-processor-dev"
      + id                             = (known after apply)
      + image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/email_request_processor@sha256:a44232f8ae329b9de96680843e4eaa5f97f23f5c5bd696d99a0e060a9af16d34"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }
    }

  # module.email_request_processor.module.lambda_function_container_image.aws_lambda_permission.unqualified_alias_triggers["sqs"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "levio-demo-fev-email-request-processor-dev"
      + id                  = (known after apply)
      + principal           = "sqs.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "sqs"
      + statement_id_prefix = (known after apply)
    }

  # module.email_response_processor.module.fifo_sqs.aws_sqs_queue.this[0] will be created
  + resource "aws_sqs_queue" "this" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = true
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "levio-demo-fev-email-response-processor-queue-dev.fifo"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags_all                          = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 60
    }

  # module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:*",
            ]
          + sid       = "loggroup"
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:log-group:/aws/levio-demo-fev-email-response-processor-dev/*:*",
            ]
          + sid       = "logwrite"
        }
      + statement {
          + actions   = [
              + "ses:SendEmail",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ses:us-east-1:446872271111:*",
            ]
          + sid       = "ses"
        }
      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
          + sid       = "sqs"
        }
    }

  # module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.email_response_processor.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/levio-demo-fev-email-response-processor-dev"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # module.email_response_processor.module.lambda_function_container_image.aws_iam_policy.additional_inline[0] will be created
  + resource "aws_iam_policy" "additional_inline" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "levio-demo-fev-email-response-processor-dev-role-inline"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # module.email_response_processor.module.lambda_function_container_image.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "levio-demo-fev-email-response-processor-dev-role-logs"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # module.email_response_processor.module.lambda_function_container_image.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "levio-demo-fev-email-response-processor-dev-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.email_response_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_inline" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "levio-demo-fev-email-response-processor-dev-role"
    }

  # module.email_response_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "levio-demo-fev-email-response-processor-dev-role"
    }

  # module.email_response_processor.module.lambda_function_container_image.aws_lambda_event_source_mapping.this["sqs"] will be created
  + resource "aws_lambda_event_source_mapping" "this" {
      + enabled                       = true
      + event_source_arn              = (known after apply)
      + function_arn                  = (known after apply)
      + function_name                 = (known after apply)
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # module.email_response_processor.module.lambda_function_container_image.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "levio-demo-fev-email-response-processor-dev"
      + id                             = (known after apply)
      + image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/email_response_processor@sha256:580f418354aee11c642823f61dc2189011db73524bc382049ac16796c9ded18d"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "SENDER_EMAIL" = "bruno.abreu@levio.ca"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }
    }

  # module.email_response_processor.module.lambda_function_container_image.aws_lambda_permission.unqualified_alias_triggers["sqs"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "levio-demo-fev-email-response-processor-dev"
      + id                  = (known after apply)
      + principal           = "sqs.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "sqs"
      + statement_id_prefix = (known after apply)
    }

  # module.inference.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-inference-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/inference@sha256:850b85cb3924981053ddfd0b750a4e7ff988dcab79a14a6169f7a7127749a6b8" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/inference@sha256:d676940b1f9fe4fcfbb9c254da9911e302786782bde89fd3f8892e6c3ee322d2"
      ~ last_modified                  = "2024-02-21T19:29:17.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-ingestion-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/ingestion@sha256:0c28ff06110dee2c2d1ea0fa1c1a0e659ba8552fd5da31952897b6b179bd0e13" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/ingestion@sha256:cd9e0205c77acf8e6f5df853a5d71cb1acac8b880f946caefba7a2ee78bd3a82"
      ~ last_modified                  = "2024-02-21T19:29:17.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.lex_router.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-lex-router-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/lex_router@sha256:5a33670327a1656c742eec070da3c2dfca41665526290f3fccfd3d534b975486" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/lex_router@sha256:8573c95bbbb88f8f88139ffb3a323e9d15d8697b9810cf6fbc2d61376bb8d80c"
      ~ last_modified                  = "2024-02-21T19:29:17.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.list_collections.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-list-collections-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/list_collections@sha256:518cd335842f28345ce9559be9fe9b00ce7a46e82570f27f36182345ade0d8cf" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/list_collections@sha256:d7d3053d214375c2f1669cd5b66deb6deaf44e026a39db42a48d659eaf5bb71f"
      ~ last_modified                  = "2024-02-21T19:29:17.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.memory.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-memory-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/conversation_memory@sha256:67afba4311972773643b901c1011cf7007c5dfe689b307b8de2eab7708bfa8b4" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/conversation_memory@sha256:3ca6a491ac127dada2b9ca8a470855f761ba0374c1bbc1abfeae1b1468363c7d"
      ~ last_modified                  = "2024-02-21T19:29:17.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 21 to add, 6 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: terraform.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.tfplan"

```

</details>

*Pusher: @brunoabreu-levio, Action: `pull_request`, Workflow: `Deploy Lambdas & Terraform Plan on PR`*